package main

import (
	"context"
	"fmt"
	"os"
	"os/signal"
	"strconv"
	"syscall"
)

func main() {
	// Person() // вызов функции для L1.1
	// GoroutineVersionOne() // вызов функции для L1.2
	// GoroutineVersionTwo() // вызов функции для L1.2

	// запустить программу нужно из терминала с помощью команды go run main.go L1.3.go 5, где 5 - кол-во воркеров

	// Проверяем, передан ли аргумент командной строки (количество воркеров)
	if len(os.Args) < 2 {
		// Если аргумент не передан, выводим инструкцию по запуску программы
		fmt.Println("Usage: go run main.go L1.3.go <num_workers>")
		return // Завершаем выполнение main(), так как нет нужного аргумента
	}

	// Преобразуем первый аргумент командной строки в целое число
	N, err := strconv.Atoi(os.Args[1])

	// Проверяем, была ли ошибка преобразования или число меньше, или равно 0
	if err != nil || N <= 0 {

		// Если аргумент некорректный, выводим сообщение об ошибке
		fmt.Println("Введите корректное число воркеров")
		return // Завершаем выполнение main(), так как введено неправильное значение
	}

	//создание контекста, который отменится, когда пользователь нажмет Ctrl+C или придет другой сигнал завершения
	ctx, stop := signal.NotifyContext(context.Background(), syscall.SIGINT, syscall.SIGTERM)
	defer stop() // освобождаем ресурсы

	Channels(N, ctx) // вызываем функцию из L1.3.go

}
